** Ejemplo autómata (JavaScript)

En general, existen varias formas de implementar un autómata en JavaScript:


#+begin_src js :results output :exports both
const estados = {
// estado: verde
  verde: { 
// evento: cambio : siguiente estado: amarillo
    'cambio': 'amarillo' 
  },
  amarillo: { 
    'cambio': 'rojo' 
  },
  rojo: { 
    'cambio': 'verde' 
   },
};

function transicion(estado,evento) {
 switch(estado) {
  case "verde":
  console.log(estados[estado][evento]);
  break;
  case "amarillo":
  console.log(estados[estado][evento]);
  break;
  case "rojo":
  console.log(estados[estado][evento]);
  break;
  default:
  console.log("error estado o evento inválido");
 }
}

transicion("verde",    "cambio");
transicion("amarillo", "cambio");
transicion("rojo",     "cambio");
transicion("azul",     "cambio");    // estado inválido 
transicion("azul",     "asdfasdf"); // estado inválido, evento inválido


#+end_src

#+RESULTS:
: amarillo
: rojo
: verde
: error estado o evento inválido
: error estado o evento inválido

** Ejemplo calculadora usando un autómata 

En este ejemplo la calculadora no permite que el primer símbolo ingresado sea un operador(es decir, solo acepta digitos: 0-9).
Éste  autómata es un poco más sofisticado que el anterior, los eventos tienen un "tipo", lo que permite reducir la cantidad de pares estado-evento (en el caso de los digitos pasamos de tener 10 pares de estado-evento a 1 par).

#+begin_src js :results output :exports both
const evento = {
  cero:        {tipo: "numero",   cargaUtil: 0  },
  uno:         {tipo: "numero",   cargaUtil: 1  },
  dos:         {tipo: "numero",   cargaUtil: 2  },
  tres:        {tipo: "numero",   cargaUtil: 3  },
  cuatro:      {tipo: "numero",   cargaUtil: 4  },
  cinco:       {tipo: "numero",   cargaUtil: 5  },
  seis:        {tipo: "numero",   cargaUtil: 6  },
  siete:       {tipo: "numero",   cargaUtil: 7  },
  ocho:        {tipo: "numero",   cargaUtil: 8  },
  nueve:       {tipo: "numero",   cargaUtil: 9  },
  sumar:       {tipo: "operador", cargaUtil:"+" },
  restar:      {tipo: "operador", cargaUtil:"-" },
  multiplicar: {tipo: "operador", cargaUtil:"X" },
  dividir:     {tipo: "operador", cargaUtil:"/" },
  igual:       {tipo: "igual",    cargaUtil:"=" },
};

const estados = {
// estado: ESPERANDO
 ESPERANDO: {
   numero: "OPERANDO1", // evento: numero, próximo estado operando1
   cero:   "OPERANDO1"  // evento: cero,   próximo estado operando1
 },
 OPERANDO1: {
   numero: "OPERANDO1"
 }
};

function transicion(estado, evento) {
  const estadoSiguiente = estados[estado][evento.tipo];

  switch(estadoSiguiente) {
    case "OPERANDO1":
     console.log("| Estado: " + estadoSiguiente  + 
                " | " + "Entrada válida: " + evento.cargaUtil + " |\n");

     break;
    default: 
     console.log("| Estado: " +  estado + ", Error: entrada inválida: " + evento.cargaUtil + " |\n");
  }
}
console.log("Si la entrada/evento es válida, aceptamos la entrada/evento y pasamos al siguiente estado: \n");
transicion("ESPERANDO", evento.cero); 
transicion("ESPERANDO", evento.uno); 
transicion("ESPERANDO", evento.dos); 
transicion("ESPERANDO", evento.tres); 
transicion("ESPERANDO", evento.cuatro); 
transicion("ESPERANDO", evento.cinco); 
transicion("ESPERANDO", evento.seis); 
transicion("ESPERANDO", evento.siete); 
transicion("ESPERANDO", evento.ocho); 
transicion("ESPERANDO", evento.nueve); 

console.log("Si la entrada/evento es inválida, rechazamos la entrada/evento y nos quedamos en el estado:\n");

transicion("ESPERANDO", evento.sumar); 
transicion("ESPERANDO", evento.restar); 
transicion("ESPERANDO", evento.multiplicar); 
transicion("ESPERANDO", evento.dividir); 

console.log("---------------\n");
console.log("- Pruebas");
console.log("1. -=");
transicion("ESPERANDO", evento.restar); 
transicion("ESPERANDO", evento.igual); 

console.log("2. /1=");
transicion("ESPERANDO", evento.dividir); 
transicion("ESPERANDO", evento.uno); 
transicion("OPERANDO1", evento.igual); 
#+end_src

#+RESULTS:
#+begin_example
Si la entrada/evento es válida, aceptamos la entrada/evento y pasamos al siguiente estado: 

| Estado: OPERANDO1 | Entrada válida: 0 |

| Estado: OPERANDO1 | Entrada válida: 1 |

| Estado: OPERANDO1 | Entrada válida: 2 |

| Estado: OPERANDO1 | Entrada válida: 3 |

| Estado: OPERANDO1 | Entrada válida: 4 |

| Estado: OPERANDO1 | Entrada válida: 5 |

| Estado: OPERANDO1 | Entrada válida: 6 |

| Estado: OPERANDO1 | Entrada válida: 7 |

| Estado: OPERANDO1 | Entrada válida: 8 |

| Estado: OPERANDO1 | Entrada válida: 9 |

Si la entrada/evento es inválida, rechazamos la entrada/evento y nos quedamos en el estado:

| Estado: ESPERANDO, Error: entrada inválida: + |

| Estado: ESPERANDO, Error: entrada inválida: - |

| Estado: ESPERANDO, Error: entrada inválida: X |

| Estado: ESPERANDO, Error: entrada inválida: / |

---------------

- Pruebas
1. -=
| Estado: ESPERANDO, Error: entrada inválida: - |

| Estado: ESPERANDO, Error: entrada inválida: = |

2. /1=
| Estado: ESPERANDO, Error: entrada inválida: / |

| Estado: OPERANDO1 | Entrada válida: 1 |

| Estado: OPERANDO1, Error: entrada inválida: = |

#+end_example

